{
  "coffe": "Кофе",
  "orientalcaffe": "Orientalcaffe",
  "quality": "Качество",
  "home": "Главная",
  "about": "О нас",
  "catalog": "Каталог",
  "cooperation": "Сотрудничество",
  "services": "Сервис",
  "contacts": "Контакты",
  "skills": "Скилы",
  "process": "Процесс",
  "name": "Ваше имя",
  "e-mail": "Ваш почтовый ящик",
  "company": "Компания",
  "send": "Отправить",
  "catalog_products": "Каталог Продукции",
  "banners": {
    "b-0": "Именно то, что вы искали"
  },
  "category": {
    "coffe_beans": "Кофе в зернах",
    "coffe_single": "Кофе в монодозах",
    "coffe_nespresso": "Кофе в nespresso капсулах",
    "coffe_filter": "Фильтер кофе",
    "coffe_green": "Зеленое кофе",
    "coffe_ground": "Кофе молотый"
  },
  "category_products": {
    "coffee": "Кофе",
    "coffee_equipment": "Кофе оборудование",
    "tea": "Чаи",
    "chocolate": "Шоколад"
  },
  "about_section": {
    "headline": "(Oriental caffè) работает в Тоскане (область в Италии) с 1955 года.",
    "about_company": "это небольшая ремесленная компания, представляющая изысканность искусства итальянского обжаривания кофейных зерен. Мы производим жареный кофе и стараемся делать это хорошо, мы любим кофе и стараемся распространять культуру кофе в мире. Ценности и страсть – наследие нашей компании, связанное с драгоценным багажом знаний, которые с особой заботой и вниманием ежедневно внедряются в практику, начиная с сортировки и отбора сырья для завершения процесса на стадии обжаривания и смешивания зерен. Из-за обжаривания кофейных зерен и сборки смеси",
    "about_company_two": "мастер жарки, руководствуясь своими чувствами, выражает всю душу нашей работы: поиск приятнейшей экстракции ароматов в их гармоничном и сбалансированном сочетании. Цель проста и ясна: каждая чашка нашего кофе должна выражать уникальную эмоцию ароматов. Наша философия состоит в том, чтобы хорошо делать качественный кофе, для этого вся цепочка, сопровождающая жизнь кофейного зерна от семян до чашки напитка должна преследовать эту цель совершенства с той же страстью и преданностью. Это означает исследовать такую философию у крестьян, которые вырастили зеленый кофе, проявляющийся в каждом ежедневном жесте, направленном на оценку сенсорного потенциала их кофе по сравнению с территорией и био-разнообразием. Это значит - делиться с нашими клиентами культурой кофе и уверенностью в том, что из-за его экстракции выражается вся любовь к аромату, сопровождавшая каждый предыдущий выбор.",
    "about_company_three": "Эта общность намерений является основой нашего искусства и предпосылкой для дегустации кофе."
  }
}
