{
  "coffe": "Кофе",
  "orientalcaffe": "Orientalcaffe",
  "quality": "Якість",
  "home": "Головна",
  "about": "О нас",
  "catalog": "Каталог",
  "cooperation": "Співробітництво",
  "services": "Послуги",
  "contacts": "Контакти",
  "name": "Імʼя",
  "e-mail": "Почтова скринка",
  "company": "Компанія",
  "send": "Відправити",
  "catalog_products": "Каталог продукції",
  "banners": {
    "b-0": "Саме те, що ви шукали"
  },
  "category": {
    "coffe_beans": "Каву в зернах",
    "coffe_single": "Каву у монодозах",
    "coffe_nespresso": "Каву у nespresso капсулах",
    "coffe_filter": "Фільтер кава",
    "coffe_green": "Зелена кава",
    "coffe_ground": "Кава мелена"
  },
  "category_products": {
    "coffee": "Кава",
    "coffee_equipment": "Кавове обладнання",
    "tea": "Чаи",
    "chocolate": "Шоколад"
  },
  "about_section": {
    "headline": "(Oriental caffè) працює у Тоскані (область в Італії) з 1955 року.",
    "about_company": "це невелика реміснича компанія, що представляє вишуканість мистецтва італійського обсмажування кавових зерен. Ми виробляємо смажену каву і намагаємося робити це добре, ми любимо каву і намагаємося поширювати культуру кави у світі. Цінності та пристрасть – спадщина нашої компанії, пов'язана з дорогоцінним багажем знань, які з особливою турботою та увагою щодня впроваджуються у практику, починаючи від сортування та відбору сировини для завершення процесу на стадії обсмажування та змішування зерен. Через обсмажування кавових зерен та збирання суміші",
    "about_company_two": "майстер смаження, керуючись своїми почуттями, висловлює всю душу нашої роботи: пошук найприємнішої екстракції ароматів у їх гармонійному та збалансованому поєднанні. Ціль проста і ясна: кожна чашка нашої кави повинна виражати унікальну емоцію ароматів. Наша філософія полягає в тому, щоб добре робити якісну каву, для цього весь ланцюжок, що супроводжує життя кавового зерна від насіння до чашки напою, має переслідувати цю мету досконалості з тією ж пристрастю і відданістю. Це означає дослідити таку філософію у селян, які виростили зелену каву, що виявляється у кожному щоденному жесті, спрямованому на оцінку сенсорного потенціалу їхньої кави в порівнянні з територією та біо-різноманіттям. Це означає - ділитися з нашими клієнтами культурою кави та впевненістю в тому, що через її екстракцію виявляється вся любов до аромату, що супроводжувала кожен попередній вибір.",
    "about_company_three": "Ця спільність намірів є основою нашого мистецтва та передумовою для дегустації кави."
  }
}
