import { ProductCardInterface } from "../interfaces/appointments";

/* 
cost in eur
*/

export const products = [
  {
    id: 1,
    category: "coffee",
    type_of_coffee: "В зернах",
    sort: "Arabica 80% / Robusta 20%",
    name: "il Rosso",
    weight: 1,
    weight_box: 12,
    cost: 16.4,
    desc: "Купаж il ROSSO : 80% елітна Arabica з Центральної і Південної Америки і суміш високоякісної відбірної Robusta з найкращих областей Індії для найкращого італійського еспрессо. Дуже яскравий сорт, який сподобається любителям міцної кави з кислинкою. Особливий італійський метод обсмажування зерен надає каві стійкий післясмак квітів і сухофруктів.",
    info: "Купаж il ROSSO : 80% елітна Arabica з Центральної і Південної Америки і суміш високоякісної відбірної Robusta з найкращих областей Індії для найкращого італійського еспрессо. Дуже яскравий сорт, який сподобається любителям міцної кави з кислинкою. Особливий італійський метод обсмажування зерен надає каві стійкий післясмак квітів і сухофруктів. Період збору з грудня по березень. Культури знаходяться в тіні дерев Інга. Класифікація SHG виражається в строго високому вирощенні, що визначає високоякісну оброблену каву, вирощену на високій землі.",
    imgUrl: "catalog/rosso.jpg",
    link: "",
  },
  {
    id: 2,
    category: "coffee",
    type_of_coffee: "В зернах",
    sort: "Arabica 100%",
    name: "Ashoka",
    weight: 1,
    weight_box: 12,
    cost: 18.8,
    desc: "Купаж ASHOKA: 100% елітна Arabica, вирощена в Південній Америці. Суміш зерен з кращих областей Бразилії і Карибського моря для справжніх цінителів якісної кави, який має характерний післясмак з нотками мигдалю, арахісу і солодких фруктів.",
    info: 'Зростання кави відбувається на повному сонці - період збору врожаю з вересня по січень і з квітня по червень. Плантація знаходиться у відділі CACUA, де працює кооператив місцевих фермерів "Asociaciòn Mujeres Cafeteras". Класифікація SHG виражається в строго високому вирощенні, що визначає високоякісну оброблену каву, вирощену на високій землі. Кава виростає на околицях району Гірі, навколо гір та пагорбів діапазону Бабабудан. Вона збирається вручну та обробляється традиційним методом.',
    imgUrl: "catalog/ashoka.jpg",
    link: "",
  },
  {
    id: 3,
    category: "coffee",
    type_of_coffee: "В зернах",
    sort: "Arabica 60% / Robusta 40%",
    name: "il Blu",
    weight: 1,
    weight_box: 12,
    cost: 15.9,
    desc: "Купаж il BLU: 60% Арабіка з Центральної і Південної Америки і суміш високоякісної відбірної Робусти з найкращих областей Індії для найкращого італійського еспрессо. Особливий італійський метод обсмажування зерен надає каві аромат зі стійким післясмаком фундука і шоколаду.",
    info: "Вирощування в тіні - період збору з грудня по січень. Кава виростає на околицях району Гірі, навколо гір та пагорбів діапазону Бабабудан. Вона збирається вручну та обробляється традиційним методом, що миється.",
    imgUrl: "catalog/ashoka.jpg",
    link: "",
  },
] as unknown as ProductCardInterface[];
